{
  "amiga": "<h2>The story of my Amiga</h2><br/><p>I grew up with the Commodore 64, the most popular home computer ever, released in 1982. I mainly played games on it though I did learn to program simple game concepts in BASIC. In 1985 Commodore bought Amiga to produce the A1000, a revolutionary machine that allowed one to create 2d/3d graphics, compose music, do office work and play great games! I bought the cheaper A500 a few years later, which I soon upgraded to the A1200. This would be the last Amiga model since Commodore basically lost out to Windows and Apple machines.</p><br/><p>I did convert my A1200 to a tower model, added a hard drive, cd-rom, more memory and a faster CPU. The operating system was revised a few times and even in 1995 it could browse the web! I thrived creatively, animating, composing tracker music, and venturing into 3D graphics. I embraced the demoscene culture, forging lasting friendship. At the end of the nineties, many Amiga users had left for the Windows PC. These computers were much faster and often cheaper because of the generic components they were made of.</p><br/><p>A handful of companies continued producing hardware and software for the Amiga, with the pinnacle expansion being the 060 processor card with PowerPC co-processor. Coupled with more memory and a graphics card, it breathed new life into decade-old Amiga tech. It even played some of the latest games from that time, like Wipeout 2097 and Quake. It was the last investment I made for my Amiga, since it broke down 2 years later and I too had to switch to a PC for school and work.</p><br/><p>Ten years later, I finally had time and funding to return to my roots. I replaced the broken hardware, upgraded the software and kept looking for ways to improve my Amiga. After a few years I had my dream machine complete, but one thing kept bothering me: the processor! While many Amiga users embraced very fast FPGA-based accelerator boards like the Vampire, I yearned for the authenticity of original hardware technology. The idea of using FPGA felt like cheating, caused compatibility issues and would render my beloved PPC-based graphics card useless. Finding an alternative for RTG graphics, like adding Radeon or Voodoo cards via a busboard, didn't sit well with me either; I wanted to preserve the essence of my Amiga and not use genuine pc hardware.</p><br/><p>A renowned Amiga tweaker from Poland offered to boost my system to 330MHz (with the 060 at 66MHz). However, transport of my precious card made me hesitate. Then some guy from my own country offered me his upgraded card and I bought it without thinking. I mistakenly envisioned a smooth plug & play experience, but instead I encountered numerous issues during installation. The demands for power and cooling put me off: how stable would it be? how long would it last? wouldnt I regret this forever? I decided to sell it and stick with my (only slightly slower) classic set up.</p><br/><p>And so ends my story of the machine I've known for some 35 years! It has its own desk in my game room and I still use it now and then. Most time these days is spent making awful music, tweaking the operating system, trying out and upgrading the software that I installed on it, and I do play the occasional game now and then. I still follow the demoscene and its amazing to see how (more talented) people can still make this machine shine!</p>"
}
